import React from 'react';
import Mehanika from './../../img/mehanika.jpg';
import './mehanika.css'

export const MehanikaPage = () => {
  return (
    <>
      <img src={Mehanika} alt='mehanika' className='image-mehanika' />
      <div className='wrap-mehanika'>
        <p className='text-mehanika'>
          МЕХАНІКА - це розділ фізики, який вивчає закони механічного руху та механічної взаємодії.
        </p>
        <p>
          Механічний рух - це зміна з часом положення тіла відносно іншого тіла, яке називають тілом відліку.
          <br />
          У СІ одиницею вимірювання довжини є 1 м (один метр), часу - 1 с (одна секунда).
          <br />
          Матеріальна точка - це тіло, розмірами якого в умовах даної задачі можна знехтувати.
          <br />
          Траєкторія - це лінія, по якій рухається тіло. Шлях - це довжина траєкторії.
          <br />
          Прямолінійним рівномірним рухом називають рух, при якому тіло за будь-які однакові проміжки часу здійснює рівномірні переміщення.
        </p>
      </div>
    </>
  )
}
