import React from 'react';
import Optika from './../../img/optika.webp';
import './optika.css'

export const OptikaPage = () => {
  return (
    <>
    <div className='wrap-content'>
      <div className='wrap-optika'>
        <div className='wrapper'>
          <img src={Optika} alt='optika' className='image-optika' />
          <p className='text-electrica'>
            ОПТИКА - це розділ фізики, який вивчає природу оптичного випромінювання (світла), а також досліджує процеси випромінення світла, його поширення в різних середовищах та взаємодії з речовиною.
          </p>
        </div>
        <div className='wrap-text'>
          <p>
            <span className='title-span'>Світло</span> - це електромагнітне випромінювання певного діапазону хвиль (від 380 до 760 нм). Йому властивий корпускулярно-хвильовий дуалізм, тобто світло має як безперервні, хвильові властивості, так і дискретні (корпускулярні).
            <br />
            В одних випадках (інтерференція, дифракція, поляризація) світло виявляє хвильову природу, в інших (поглинання, фотоефект) - прявляється його корпускулярна природа.
            <br />
            <span className='title-span'>Світловий промінь</span> - це лінія, уздовж якої поширюється світлова енергія. 
            <br />
            Світло у вакуумі поширюється зі сталою швидкістю, що дорівнює с = 3 &#215; 10<sup>8</sup> м/с.
            <br />
            <span className='title-span'>Абсолютний показник заломлення середовища n</span> - це фізична величина, що показує, у скільки разів швидкість світла у вакуумі (с) більша за швидкість світла у середовищі (v): n=c/v
            <br />
            <span className='title-span'>Лінза</span> - це прозоре тіло, обмежене з обох боків сферичними поверхнями (одна з поверхонь може бути плоскою).
            <br />
            Лінзи бувають опуклі та ввігнуті. Лінзу, товщина якої набагато менша за радіуси сферичних поверхонь, що її обмежують, називають тонкою.
            <br />
            Лінзу називають <span className='title-span'>збиральною</span>, якщо вона перетворює паралельний пучок променів у збіжний. Якщо паралельні промені після проходження через лінзу виходять з неї розбіжним пучком, то лінзу називають <span className='title-span'>розсіювальною</span>.
            <br />
            При проходженні світла через матеріальне середовище воно частково поглинається та частково розсіюється.
          </p>
        </div>
      </div>
    </div>
  </>
  )
}
