import React from 'react';
import Yaderka from './../../img/yaderka.jpg';
import './yaderka.css'

export const YaderkaPage = () => {
  return (
    <>
    <div className='wrap-content'>
      <div className='wrap-yaderka'>
        <div className='wrapper'>
          <img src={Yaderka} alt='yaderka' className='image-yaderka' />
          <p className='text-yaderka'>
            ЯДЕРНА ФІЗИКА - це розділ фізики, який вивчає структуру та властивості атомних ядер, а також механізми ядерних реакцій (наприклад, радіоактивний розпад).
          </p>
        </div>
        <div className='wrap-text'>
          <p>
            <ol>
              <span className='title-span'>Склад ядра атома:</span>
              <li><span className='title-span'>Протон (p)</span> - елементарна частинка, що входить до складу ядра, заряд якої дорівнює +e = 1,6 &#215; 10<sup>-19</sup> Кл, а маса m<sub>p</sub> = 1,00728 а.о.м. = 1,67 &#215; 10<sup>-27</sup> кг</li>
              <li><span className='title-span'>Нейтрон (n)</span> - нейтральна елементарна частинка, що входить до складу ядра і має масу m<sub>n</sub> = 1,67 &#215; 10<sup>-27</sup> кг</li>
            </ol>
            Протон (ядро атома Гідрогену) відкрив Резерфорд у 1919 р. Нейтрон відкрив Чедвік у 1932 р. Протони і нейтрони називають <span className='title-span'>нуклонами</span>.
            <br />
            <span className='title-span'>Протонне число (Z)</span> - кількість протонів у ядрі, дорівнює порядковому номеру елемента у таблиці Менделєєва. У нейтрального атома кількість протонів у ядрі та кількість електронів в електронній оболонці однакова.
            <br />            
            <span className='title-span'>Нуклонне або масове число (А)</span> - кількість нуклонів у ядрі.
            <br />
            Кількість нейтронів у ядрі атома визначається за формулою: N = A - Z
            <br />            
            <span className='title-span'>Ізотопи</span> - це атоми того самого хімічного елемента, ядра яких містять однакову кількість протонів, але різну кількість нейтронів.
            <br />            
            <span className='title-span'>Ядерні реакції</span> - це перетворення атомних ядер при їх взаємодії з елементарними частинками або з іншими ядрами.
            <br />            
            <span className='title-span'>Радіоактивність</span> - це перетворення ядер одних хімічних елементів у ядра інших. Радіоактивність може бути природною (самовільний розпад ядер) та штучною, коли ядра зазнають перетворень при їх бомбардуванні іншими частинками.
          </p>
        </div>
      </div>
    </div>
  </>
  )
}
