import React from 'react';
import Electrica from './../../img/electrician.webp';
import './electrica.css'

export const ElectricaPage = () => {
  return (
    <>
      <div className='wrap-content'>
        <div className='wrap-electrica'>
          <div className='wrapper'>
            <img src={Electrica} alt='electrica' className='image-electrica' />
            <p className='text-electrica'>
              ЕЛЕКТРИКА - це розділ фізики, який вивчає електричні явища: взаємодію між зарядженими тілами та проходження електричного струму.
            </p>
          </div>
          <div className='wrap-text'>
            <p>
              <span className='title-span'>Електричний заряд q</span> - це скалярна фізична величина, що характеризує інтенсивність електричної взаємодії. Одиницею вимірювання електричного заряду в СІ є 1 Кл (один Кулон).
              <br />
              У природі існує два види електричних зарядів: позитивні та негативні. Негативно заряджене тіло має надлишок електронів, а позитивно заряджене - їх нестачу. При взаємодії однойменно заряджені тіла відштовхуються, ф різнойменно заряджені - притягуються.
              <br />
              <span className='title-span'>Електрон</span> - це негативно заряджена частинка, що входить до складу атома. Заряд електрона дорівнює e = -1,6 &#215; 10<sup>-19</sup> Кл і має назву елементарного.
              <br />
              <span className='title-span'>Електричний струм</span> - це напрямлений рух заряджених частинок, які називають вільними носіями заряду. Вільними носіями заряду можуть бути електрони, позитивні та негативні йони. За напрямок струму приймають напрямок руху позитивно заряджених частинок.
              <ol>
                <span className='title-span'>Для протікання струму необхідні такі умови:</span>
                <li>наявність вільних носіїв заряду;</li>
                <li>наявність електричного поля у провідниках, з яких складається коло</li>
              </ol>
              <span className='title-span'>Сила струму I</span> - це скалярна фізична величина, яка дорівнює відношенню заряду q, перенесеному через поперечний переріз провідника за час t. Одниця вимірювання сили струму в СІ - 1 А (один Ампер).
              <br />
              При проходженні струму по провідниках можна спостерігати теплову, магнітну, хімічну та механічну дії.
            </p>
          </div>
        </div>
      </div>
    </>
  )
}
